anthropic.claude-code
augment.vscode-augment
bibhasdn.unique-lines
bierner.markdown-mermaid
charliermarsh.ruff
docker.docker
donjayamanne.githistory
doordash.devbox
dunstontc.vscode-docker-syntax
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot-chat
github.vscode-pull-request-github
grapecity.gc-excelviewer
gruntfuggly.todo-tree
jsynowiec.vscode-insertdatestring
lencerf.beancount
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
ms-vscode.remote-explorer
redhat.vscode-yaml
searking.preview-vscode
stkb.rewrap
tamasfe.even-better-toml
tht13.rst-vscode
trond-snekvik.simple-rst
wolfmah.ansible-vault-inline
yzane.markdown-pdf
